In [2]:
people = {
    "first": ["Shankar", "Niru", "Akshara"],
    "last": ["R", "S", "S"],
    "email": ["shan@email.com", "niru@email.com", "aksh@email.com"]
}

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

     first last           email
0  Shankar    R  shan@email.com
1     Niru    S  niru@email.com
2  Akshara    S  aksh@email.com

In [8]:
df.sort_values(by="first", ascending=False)

     first last           email
0  Shankar    R  shan@email.com
1     Niru    S  niru@email.com
2  Akshara    S  aksh@email.com

In [11]:
# sorting with columns means if first column (last) has duplicates,
# then they will be sorted based on second column
df.sort_values(by=["last", "first"], ascending=True)

     first last           email
0  Shankar    R  shan@email.com
2  Akshara    S  aksh@email.com
1     Niru    S  niru@email.com

In [15]:
# sorting multiple columns with different order (say ascending for first column and descending for second column)
df.sort_values(by=["last", "first"], ascending=[False, True], inplace=True)
df

     first last           email
2  Akshara    S  aksh@email.com
1     Niru    S  niru@email.com
0  Shankar    R  shan@email.com

In [16]:
# reset any sort can be done if sort is done on index
df.sort_index()

     first last           email
0  Shankar    R  shan@email.com
1     Niru    S  niru@email.com
2  Akshara    S  aksh@email.com

In [17]:
# sorting just a series is as simple as below
df["first"].sort_values()

2    Akshara
1       Niru
0    Shankar
Name: first, dtype: object